In [298]:
import pandas as pd
import datetime as dt
import time
meses = ['JAN', 'FEV', 'MAR', 'ABR', 'MAI', 'JUN', 'JUL', 'AGO', 'SET', 'OUT', 'NOV', 'DEZ']

In [279]:
# LÊ A TABELA
tabela = pd.read_excel('vendas.xlsx')
# CONVERTE A COLUNA 'DATA' PARA O FORMATO DE DATA
tabela['DATA'] = pd.to_datetime(tabela['DATA'])

In [280]:
# CRIA UMA LISTA COM OS ANOS DA COLUNA DATA DA TABELA E REMOVE AS DUPLICATAS
anos_tabela = tabela['DATA'].dt.year
lista_anos = []
for _ in range(len(anos_tabela)):
    if anos_tabela[_] not in lista_anos:
        lista_anos.append(anos_tabela[_])
print(lista_anos)

[2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022]

In [325]:
# CRIA UM DATAFRAME COM A LISTA  DE ANOS CRIADA E OS MESES DO ANO
for _ in range(len(lista_anos)):
    relatorio = pd.DataFrame(columns=lista_anos, index=meses)

i = 0
for _ in range(12):
    for i in range(len(lista_anos)):
        relatorio.loc[meses[_], lista_anos[i]] = _ + i

In [326]:
tabela['ANO'] = tabela['DATA'].dt.year
tabela['MES'] = tabela['DATA'].dt.month

display(tabela.groupby(by=['PEDIDO'])['TOTAL'].sum())

PEDIDO
BIQUINI      4273
BONE         5004
CAMISA       2141
CUECA BOX    8720
SANDALIA     4147
SHORT        4615
TOALHA       4897
Name: TOTAL, dtype: int64

In [307]:
# display(relatorio)
# i = 0
# for i in range(len(lista_anos)):
#     for _ in range(12):
#         print(f'Mês: {meses[_]}, Ano: {lista_anos[i]}, Valor: {relatorio.loc[meses[_], lista_anos[i]]}')

In [329]:
# for i in range(len(lista_anos)):
#     print(f'ANO: {lista_anos[i]}, Quant. Total: ', relatorio.loc[meses, lista_anos[i]].sum())

for _ in range(13):
    tabela2 = tabela.loc[tabela['MES'] == _]
    display(tabela2)

Empty DataFrame
Columns: [DATA, PEDIDO, QUANTIDADE, VALOR UNIDADE, TOTAL, ANO, MES]
Index: []

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
0  2015-01-01     CAMISA           2             57    114  2015    1
12 2016-01-01    BIQUINI           1            133    133  2016    1
24 2017-01-01  CUECA BOX           1             93     93  2017    1
36 2018-01-01   SANDALIA           6            120    720  2018    1
48 2019-01-01       BONE           3             54    162  2019    1
60 2020-01-01  CUECA BOX           5             14     70  2020    1
72 2021-01-01   SANDALIA           2             24     48  2021    1
84 2022-01-01     CAMISA           6            145    870  2022    1

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
1  2015-02-01      SHORT           6             81    486  2015    2
13 2016-02-01       BONE           6             16     96  2016    2
25 2017-02-01  CUECA BOX           1             35     35  2017    2
37 2018-02-01     TOALHA           5             21    105  2018    2
49 2019-02-01      SHORT           2            110    220  2019    2
61 2020-02-01    BIQUINI           3             45    135  2020    2
73 2021-02-01     TOALHA           1            116    116  2021    2
85 2022-02-01      SHORT           7             90    630  2022    2

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
2  2015-03-01   SANDALIA           6            107    642  2015    3
14 2016-03-01     CAMISA           5            103    515  2016    3
26 2017-03-01    BIQUINI           4             62    248  2017    3
38 2018-03-01  CUECA BOX           7            143   1001  2018    3
50 2019-03-01   SANDALIA           4            128    512  2019    3
62 2020-03-01       BONE           7             82    574  2020    3
74 2021-03-01  CUECA BOX           8            106    848  2021    3
86 2022-03-01   SANDALIA           5             22    110  2022    3

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
3  2015-04-01     TOALHA           5             97    485  2015    4
15 2016-04-01      SHORT           2            105    210  2016    4
27 2017-04-01       BONE           2             37     74  2017    4
39 2018-04-01  CUECA BOX           5            143    715  2018    4
51 2019-04-01     TOALHA           8            141   1128  2019    4
63 2020-04-01      SHORT           7            106    742  2020    4
75 2021-04-01    BIQUINI           7             57    399  2021    4
87 2022-04-01     TOALHA           2             50    100  2022    4

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
4  2015-05-01  CUECA BOX           4             87    348  2015    5
16 2016-05-01   SANDALIA           8             23    184  2016    5
28 2017-05-01     CAMISA           2             42     84  2017    5
40 2018-05-01    BIQUINI           2             44     88  2018    5
52 2019-05-01  CUECA BOX           7             23    161  2019    5
64 2020-05-01   SANDALIA           8             78    624  2020    5
76 2021-05-01       BONE           4            124    496  2021    5
88 2022-05-01  CUECA BOX           3             67    201  2022    5

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
5  2015-06-01    BIQUINI           8             55    440  2015    6
17 2016-06-01     TOALHA           7             50    350  2016    6
29 2017-06-01      SHORT           2            127    254  2017    6
41 2018-06-01       BONE           8             51    408  2018    6
53 2019-06-01  CUECA BOX           6            134    804  2019    6
65 2020-06-01     TOALHA           1             57     57  2020    6
77 2021-06-01      SHORT           1            110    110  2021    6
89 2022-06-01    BIQUINI           7            130    910  2022    6

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
6  2015-07-01       BONE           8             69    552  2015    7
18 2016-07-01  CUECA BOX           7             83    581  2016    7
30 2017-07-01   SANDALIA           4             43    172  2017    7
42 2018-07-01     CAMISA           2            137    274  2018    7
54 2019-07-01    BIQUINI           1             43     43  2019    7
66 2020-07-01  CUECA BOX           6            144    864  2020    7
78 2021-07-01   SANDALIA           3             82    246  2021    7
90 2022-07-01       BONE           8            101    808  2022    7

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
7  2015-08-01      SHORT           3            111    333  2015    8
19 2016-08-01    BIQUINI           6             90    540  2016    8
31 2017-08-01     TOALHA           1            145    145  2017    8
43 2018-08-01      SHORT           4             99    396  2018    8
55 2019-08-01       BONE           3             11     33  2019    8
67 2020-08-01  CUECA BOX           4            115    460  2020    8
79 2021-08-01     TOALHA           5             83    415  2021    8
91 2022-08-01      SHORT           8             30    240  2022    8

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
8  2015-09-01   SANDALIA           2             13     26  2015    9
20 2016-09-01       BONE           6            125    750  2016    9
32 2017-09-01  CUECA BOX           8             10     80  2017    9
44 2018-09-01   SANDALIA           5              9     45  2018    9
56 2019-09-01     CAMISA           3             28     84  2019    9
68 2020-09-01    BIQUINI           5             56    280  2020    9
80 2021-09-01  CUECA BOX           1             29     29  2021    9
92 2022-09-01   SANDALIA           1             74     74  2022    9

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
9  2015-10-01     TOALHA           5             95    475  2015   10
21 2016-10-01      SHORT           5             83    415  2016   10
33 2017-10-01    BIQUINI           4              7     28  2017   10
45 2018-10-01     TOALHA           5             44    220  2018   10
57 2019-10-01      SHORT           1            111    111  2019   10
69 2020-10-01       BONE           8             59    472  2020   10
81 2021-10-01  CUECA BOX           6             12     72  2021   10
93 2022-10-01     TOALHA           2            103    206  2022   10

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
10 2015-11-01  CUECA BOX           7             62    434  2015   11
22 2016-11-01   SANDALIA           3            150    450  2016   11
34 2017-11-01       BONE           3             65    195  2017   11
46 2018-11-01  CUECA BOX           6            145    870  2018   11
58 2019-11-01   SANDALIA           2            147    294  2019   11
70 2020-11-01     CAMISA           5             40    200  2020   11
82 2021-11-01    BIQUINI           8             48    384  2021   11
94 2022-11-01  CUECA BOX           5             94    470  2022   11

         DATA     PEDIDO  QUANTIDADE  VALOR UNIDADE  TOTAL   ANO  MES
11 2015-12-01  CUECA BOX           8              1      8  2015   12
23 2016-12-01     TOALHA           8            131   1048  2016   12
35 2017-12-01      SHORT           1            138    138  2017   12
47 2018-12-01    BIQUINI           5            129    645  2018   12
59 2019-12-01     TOALHA           1             47     47  2019   12
71 2020-12-01      SHORT           6             55    330  2020   12
83 2021-12-01       BONE           4             96    384  2021   12
95 2022-12-01  CUECA BOX           4            144    576  2022   12

In [ ]:
relatorio.to_excel("RELATORIO.xlsx",sheet_name='TODOS OS ANOS')